In [425]:
import pandas as pd #tablas https://pandas.pydata.org/docs/user_guide/pyarrow.html
import numpy as np #estadistica https://numpy.org/doc/1.25/user/index.html#user
import matplotlib.pyplot as plt #gráficos https://matplotlib.org/stable/plot_types/index.html
import seaborn as sns #gráficos https://seaborn.pydata.org/tutorial/regression.html
from sklearn import linear_model #modelo de regresion https://scikit-learn.org/stable/
from sklearn.preprocessing import MinMaxScaler # do not use the function Normalise() - it does something entirely different
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.metrics import mean_absolute_error
from datetime import datetime #https://docs.python.org/3/library/datetime.html
from datetime import timedelta #this is a good time to learn about dates and timestamps. You can find some info here:
from sklearn.linear_model import LogisticRegression
from sklearn.utils import resample
from imblearn.over_sampling import SMOTE
from sklearn.metrics import confusion_matrix
from sklearn.metrics import precision_score
from sklearn.metrics import recall_score
from sklearn.metrics import f1_score
from sklearn.neighbors import KNeighborsClassifier
from scipy.stats import ttest_1samp
import scipy.stats as st
from sklearn.neighbors import KNeighborsClassifier
from mlxtend.plotting import plot_decision_regions
import pandas as pd
import numpy as np
import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication
from getpass import getpass  # To get the password without showing the input

let's try to do the same than with the stock cleaning for TSLA without the TSLA filter

In [426]:
exdt = pd.read_csv('expiration_date_KEY.csv')

In [427]:
exdt['expiration_date'] = pd.to_datetime(exdt['expiration_date'])

In [428]:
password = getpass()

In [429]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/raw_data'
engine = create_engine(connection_string)
query = '''SELECT * FROM stock_information;'''

stock = pd.read_sql_query(query, engine)

In [430]:
stock['Date'] = pd.to_datetime(stock['Date'])

In [431]:
stock.head()

,company_id,Date,Open,High,Low,Close,Adj Close,Volume
0,TSLA,2013-01-02,2.333333,2.363333,2.314000,2.357333,2.357333,17922000
1,TSLA,2013-01-03,2.345333,2.363333,2.316667,2.318000,2.318000,11130000
2,TSLA,2013-01-04,2.320000,2.320000,2.261333,2.293333,2.293333,10110000
3,TSLA,2013-01-07,2.320000,2.320000,2.260000,2.289333,2.289333,6630000
4,TSLA,2013-01-08,2.300000,2.300000,2.207333,2.245333,2.245333,19260000

In [432]:
stock.shape

(17361, 8)

MICROSOFT HAS A DUPLICATE (THAT'S WHY THE LAST FUNCTION DIDN'T WORK, IT'S TIME TO KICK IT OUT)

In [433]:
stock = stock.drop_duplicates(subset=['Date', 'company_id'])

In [434]:
stock.shape

(17340, 8)

1. OPENING AND CLOSING VALUES

In [435]:
opening_closing = pd.merge(stock, exdt, left_on='Date', right_on='expiration_date', how='inner')
opening_closing  = opening_closing.drop(["Date", "Volume","High","Low","Adj Close","Close"], axis=1)
opening_closing

    company_id        Open expiration_date
0         TSLA    2.316000      2013-01-18
1         META   30.309999      2013-01-18
2         GOOG   17.692682      2013-01-18
3         AAPL   17.804285      2013-01-18
4         AMZN   13.541500      2013-01-18
..         ...         ...             ...
803       GOOG  129.059998      2023-08-18
804        NIO   10.950000      2023-08-18
805       AAPL  172.300003      2023-08-18
806       AMZN  131.619995      2023-08-18
807       MSFT  314.489990      2023-08-18

[808 rows x 3 columns]

In [436]:
opening_closing ["company_id"].unique()

array(['TSLA', 'META', 'GOOG', 'AAPL', 'AMZN', 'MSFT', 'NIO'],
      dtype=object)

Need to do it 7 times, HERE WE GO (WE CAN QUIT, TESLA AND NIO, TESLA IT'S DONE, AND NIO HAS NO TWEETS)
AMZN, MSFT, META, AAPL, GOOG

Creating a function to speed it up

In [437]:
amazon_stock = stock[stock['company_id'] == "AMZN"].reset_index(drop=True)
microsoft_stock = stock[stock['company_id'] == "MSFT"].reset_index(drop=True)
meta_stock = stock[stock['company_id'] == "META"].reset_index(drop=True)
apple_stock = stock[stock['company_id'] == "AAPL"].reset_index(drop=True)
google_stock = stock[stock['company_id'] == "GOOG"].reset_index(drop=True)

In [438]:
#FROM TESLA_STOCK_CLEANING notebook
#opening_closing = pd.merge(tesla_stock, exdt, left_on='Date', right_on='expiration_date', how='inner')
#opening_closing  = opening_closing.drop(["Date", "Volume","High","Low","Adj Close","Close"], axis=1)
#opening_closing

In [439]:
def process_stock_data(stock_df, exdt_df):
    merged_df = pd.merge(stock_df, exdt_df, left_on='Date', right_on='expiration_date', how='inner')
    columns_to_drop = ["Date", "Volume", "High", "Low", "Adj Close", "Close"]
    processed_df = merged_df.drop(columns_to_drop, axis=1)
    
    return processed_df

In [440]:
processed_amazon_stock  = process_stock_data(amazon_stock , exdt)
processed_microsoft_stock  = process_stock_data(microsoft_stock , exdt)
processed_meta_stock  = process_stock_data (meta_stock, exdt)
processed_apple_stock   = process_stock_data(apple_stock  , exdt)
processed_google_stock  = process_stock_data(google_stock , exdt)

In [441]:
#FROM TESLA_STOCK_CLEANING notebook
#opening_closing .rename(columns={'Open': 'Closing price'}, inplace=True)
#opening_closing['Opening price'] = opening_closing['Closing price'].shift(+1)
#opening_closing = opening_closing[['expiration_date'] + [col for col in opening_closing.columns if col != 'expiration_date']]
#opening_closing ['price_change%'] = (opening_closing['Closing price'] - opening_closing['Opening price'])/(opening_closing['Opening price'])*100

In [442]:
def process_stock_data_1(stock_df, exdt_df):    
    stock_df.rename(columns={'Open': 'Closing price'}, inplace=True)
    stock_df['Opening price'] = stock_df['Closing price'].shift(+1)
    stock_df = stock_df[['expiration_date'] + [col for col in stock_df.columns if col != 'expiration_date']]
    stock_df['price_change%'] = (stock_df['Closing price'] - stock_df['Opening price']) / stock_df['Opening price'] * 100
    
    return stock_df

In [443]:
processed_amazon_stock_1  = process_stock_data_1(processed_amazon_stock , exdt)
processed_microsoft_stock_1  = process_stock_data_1(processed_microsoft_stock , exdt)
processed_meta_stock_1  = process_stock_data_1(processed_meta_stock, exdt)
processed_apple_stock_1   = process_stock_data_1(processed_apple_stock  , exdt)
processed_google_stock_1  = process_stock_data_1(processed_google_stock , exdt)

/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_27840/725511654.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  stock_df['price_change%'] = (stock_df['Closing price'] - stock_df['Opening price']) / stock_df['Opening price'] * 100
/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_27840/725511654.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  stock_df['price_change%'] = (stock_df['Closing price'] - stock_df['Opening price']) / stock_df['Opening price'] * 100
/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_27840/725511654.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  stock_df['price_change%'] = (stock_df['Closing price'] - stock_df['Opening price']) / stock_df['Opening price'] * 100
/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_27840/725511654.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  stock_df['price_change%'] = (stock_df['Closing price'] - stock_df['Opening price']) / stock_df['Opening price'] * 100
/var/folders/dm/hhj01rls7tz3g5v4m3hhj1bw0000gn/T/ipykernel_27840/725511654.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  stock_df['price_change%'] = (stock_df['Closing price'] - stock_df['Opening price']) / stock_df['Opening price'] * 100

Lets put all this together

In [444]:
unified_open_closing = pd.concat([processed_amazon_stock_1 , processed_microsoft_stock_1, processed_meta_stock_1, processed_apple_stock_1, processed_google_stock_1], axis=0)

In [445]:
unified_open_closing 
#Nan it's due to unknown opening price for T0 in TSLA was added manually

    expiration_date company_id  Closing price  Opening price  price_change%
0        2013-01-18       AMZN      13.541500            NaN            NaN
1        2013-02-15       AMZN      13.381500      13.541500      -1.181553
2        2013-03-15       AMZN      13.249000      13.381500      -0.990173
3        2013-04-19       AMZN      12.908000      13.249000      -2.573779
4        2013-05-17       AMZN      13.291500      12.908000       2.971026
..              ...        ...            ...            ...            ...
120      2023-04-21       GOOG     106.089996     100.839996       5.206268
121      2023-05-19       GOOG     124.199997     106.089996      17.070414
122      2023-06-16       GOOG     126.699997     124.199997       2.012882
123      2023-07-21       GOOG     120.870003     126.699997      -4.601416
124      2023-08-18       GOOG     129.059998     120.870003       6.775871

[625 rows x 5 columns]

Volume per period and min max, with min max volatility

In [446]:
amazon_stock 
google_stock 
apple_stock 
meta_stock 
microsoft_stock 
meta_stock

,company_id,Date,Open,High,Low,Close,Adj Close,Volume
0,META,2013-01-02,27.440001,28.180000,27.420000,28.000000,28.000000,69846400
1,META,2013-01-03,27.879999,28.469999,27.590000,27.770000,27.770000,63140600
2,META,2013-01-04,28.010000,28.930000,27.830000,28.760000,28.760000,72715400
3,META,2013-01-07,28.690001,29.790001,28.650000,29.420000,29.420000,83781800
4,META,2013-01-08,29.510000,29.600000,28.860001,29.059999,29.059999,45871300
...,...,...,...,...,...,...,...,...
2677,META,2023-08-22,292.549988,292.899994,286.750000,287.600006,287.600006,12999900
2678,META,2023-08-23,288.500000,297.399994,287.670013,294.239990,294.239990,18287000
2679,META,2023-08-24,298.500000,299.459991,286.640015,286.750000,286.750000,18360900
2680,META,2023-08-25,286.130005,288.390015,276.029999,285.500000,285.500000,23685000
2681,META,2023-08-28,288.000000,291.450012,285.799988,290.260010,290.260010,14229200

In [447]:
exdt

    expiration_date
0        2013-01-18
1        2013-02-15
2        2013-03-15
3        2013-04-19
4        2013-05-17
..              ...
120      2023-04-21
121      2023-05-19
122      2023-06-16
123      2023-07-21
124      2023-08-18

[125 rows x 1 columns]

In [448]:
#vol_exp = stock_exp.merge(exdt, how='left', left_on='Date', right_on='expiration_date')
#expiration_indices = vol_exp[vol_exp['expiration_date'].notnull()].index
#expiration_indices_1 = np.insert(expiration_indices, 0, 0)

In [449]:
def process_data_2(stock_exp_df, exdt_df):
    vol_exp = stock_exp_df.merge(exdt_df, how='left', left_on='Date', right_on='expiration_date')
    expiration_indices = vol_exp[vol_exp['expiration_date'].notnull()].index
    expiration_indices_1 = np.insert(expiration_indices, 0, 0)
    
    return expiration_indices_1

In [450]:
amazon_stock_idx = process_data_2(amazon_stock , exdt)
microsoft_stock_idx = process_data_2(microsoft_stock , exdt)
meta_stock_idx = process_data_2(meta_stock , exdt)
apple_stock_idx = process_data_2(apple_stock , exdt)
google_stock_idx = process_data_2(google_stock , exdt)

In [451]:
microsoft_stock_idx

Int64Index([   0,   12,   31,   50,   74,   94,  118,  137,  157,  181,
            ...
            2489, 2508, 2530, 2550, 2569, 2593, 2613, 2632, 2655, 2675],
           dtype='int64', length=126)

In [452]:
def convert_to_ranges(index_array):
    ranges = []
    start_index = index_array[0]
    for i in range(1, len(index_array)):
        ranges.append((start_index, index_array[i]+1))
        start_index = index_array[i]+1
    ranges.append((start_index, index_array[-1]))
    return ranges

In [453]:
amazon_stock_idx_range = convert_to_ranges(amazon_stock_idx)
microsoft_stock_idx_range = convert_to_ranges(microsoft_stock_idx)
meta_stock_idx_range = convert_to_ranges(meta_stock_idx)
apple_stock_idx_range = convert_to_ranges(apple_stock_idx)
google_stock_idx_range = convert_to_ranges(google_stock_idx )

In [454]:
amazon_stock_idx_range

[(0, 13),
 (13, 32),
 (32, 51),
 (51, 75),
 (75, 95),
 (95, 119),
 (119, 138),
 (138, 158),
 (158, 182),
 (182, 202),
 (202, 222),
 (222, 246),
 (246, 264),
 (264, 287),
 (287, 307),
 (307, 346),
 (346, 370),
 (370, 389),
 (389, 409),
 (409, 433),
 (433, 453),
 (453, 478),
 (478, 497),
 (497, 515),
 (515, 538),
 (538, 558),
 (558, 577),
 (577, 597),
 (597, 621),
 (621, 640),
 (640, 665),
 (665, 684),
 (684, 704),
 (704, 729),
 (729, 748),
 (748, 766),
 (766, 789),
 (789, 809),
 (809, 828),
 (828, 853),
 (853, 872),
 (872, 891),
 (891, 916),
 (916, 935),
 (935, 960),
 (960, 980),
 (980, 999),
 (999, 1021),
 (1021, 1041),
 (1041, 1060),
 (1060, 1084),
 (1084, 1104),
 (1104, 1123),
 (1123, 1147),
 (1147, 1167),
 (1167, 1186),
 (1186, 1211),
 (1211, 1231),
 (1231, 1250),
 (1250, 1272),
 (1272, 1292),
 (1292, 1311),
 (1311, 1335),
 (1335, 1355),
 (1355, 1374),
 (1374, 1398),
 (1398, 1418),
 (1418, 1442),
 (1442, 1462),
 (1462, 1482),
 (1482, 1505),
 (1505, 1523),
 (1523, 1542),
 (1542, 1561),
 (1561, 1605),
 (1605, 1629),
 (1629, 1648),
 (1648, 1668),
 (1668, 1692),
 (1692, 1712),
 (1712, 1732),
 (1732, 1756),
 (1756, 1774),
 (1774, 1797),
 (1797, 1817),
 (1817, 1836),
 (1836, 1856),
 (1856, 1880),
 (1880, 1899),
 (1899, 1924),
 (1924, 1943),
 (1943, 1963),
 (1963, 1988),
 (1988, 2007),
 (2007, 2025),
 (2025, 2048),
 (2048, 2068),
 (2068, 2087),
 (2087, 2112),
 (2112, 2131),
 (2131, 2150),
 (2150, 2175),
 (2175, 2194),
 (2194, 2214),
 (2214, 2239),
 (2239, 2258),
 (2258, 2281),
 (2281, 2301),
 (2301, 2320),
 (2320, 2364),
 (2364, 2383),
 (2383, 2401),
 (2401, 2426),
 (2426, 2445),
 (2445, 2470),
 (2470, 2490),
 (2490, 2509),
 (2509, 2531),
 (2531, 2551),
 (2551, 2570),
 (2570, 2594),
 (2594, 2614),
 (2614, 2633),
 (2633, 2656),
 (2656, 2676),
 (2676, 2675)]

In [455]:
#we need this dataframes to make the sum
def process_data_3(stock_exp_df, exdt_df):
    vol_exp = stock_exp_df.merge(exdt_df, how='left', left_on='Date', right_on='expiration_date')
    return vol_exp

In [456]:
amazon_stock_vol = process_data_3(amazon_stock , exdt)
microsoft_stock_vol = process_data_3(microsoft_stock , exdt)
meta_stock_vol = process_data_3(meta_stock , exdt)
apple_stock_vol = process_data_3(apple_stock , exdt)
google_stock_vol = process_data_3(google_stock , exdt)

In [457]:
google_stock_vol

,company_id,Date,Open,High,Low,Close,Adj Close,Volume,expiration_date
0,GOOG,2013-01-02,17.918339,18.107130,17.846855,18.013729,18.013729,102033017,NaT
1,GOOG,2013-01-03,18.055573,18.229919,17.950716,18.024191,18.024191,93075567,NaT
2,GOOG,2013-01-04,18.165413,18.467529,18.124067,18.380356,18.380356,110954331,NaT
3,GOOG,2013-01-07,18.317591,18.415474,18.196297,18.300158,18.300158,66476239,NaT
4,GOOG,2013-01-08,18.319834,18.338762,18.043119,18.264042,18.264042,67295297,NaT
...,...,...,...,...,...,...,...,...,...
2677,GOOG,2023-08-22,129.130005,130.949997,128.925003,129.690002,129.690002,15569400,NaT
2678,GOOG,2023-08-23,130.850006,134.070007,130.509995,133.210007,133.210007,26497000,NaT
2679,GOOG,2023-08-24,134.727005,134.970001,130.300003,130.419998,130.419998,18680400,NaT
2680,GOOG,2023-08-25,130.139999,131.399994,128.039993,130.690002,130.690002,20671000,NaT
2681,GOOG,2023-08-28,132.080002,133.240005,130.850006,131.789993,131.789993,16706400,NaT

In [458]:
def process_data_3(stock_vol, index_ranges):
    volume_sums = [stock_vol.loc[start:end, 'Volume'].sum() for start, end in index_ranges]
    volume_sums = volume_sums[:-1]
    return volume_sums

In [459]:
amazon_stock_vol_sum = process_data_3(amazon_stock_vol , amazon_stock_idx_range)
microsoft_stock_vol_sum = process_data_3(microsoft_stock_vol , microsoft_stock_idx_range)
meta_stock_vol_sum = process_data_3(meta_stock_vol , meta_stock_idx_range)
apple_stock_vol_sum = process_data_3(apple_stock_vol , apple_stock_idx_range)
google_stock_vol_sum = process_data_3(google_stock_vol , google_stock_idx_range)

In [460]:
microsoft_stock_vol_sum

[711670100,
 977837300,
 864729000,
 1381495000,
 1259670600,
 1204846400,
 1015488800,
 888640600,
 1658273800,
 783933100,
 1001617400,
 1040438600,
 631743100,
 993799700,
 746508700,
 1389203300,
 592978300,
 652128200,
 639525800,
 894251300,
 739086200,
 812981900,
 638251000,
 507215700,
 1113852600,
 763833500,
 650768100,
 925486100,
 702198900,
 592884900,
 913613100,
 811632200,
 593485000,
 1068425200,
 767523600,
 742020600,
 1089385400,
 669077100,
 443261700,
 849194000,
 614618300,
 694541000,
 730187300,
 455731800,
 698774100,
 689442000,
 524500100,
 474103700,
 557007800,
 432616100,
 494519400,
 558730900,
 549470900,
 592322000,
 453885700,
 361644700,
 433973800,
 492668800,
 499144300,
 498552300,
 815591200,
 605006900,
 842435600,
 565653200,
 523395700,
 670506700,
 492117300,
 597348000,
 641228200,
 867143400,
 1092629300,
 684311200,
 573515000,
 532613000,
 1102612900,
 586230500,
 460075700,
 559512000,
 586793600,
 455797200,
 473372800,
 553510000,
 404678200,
 850782900,
 1574360800,
 1154151100,
 796618400,
 848618400,
 670110700,
 898043500,
 753933600,
 606371000,
 778602500,
 594601300,
 471205800,
 729979300,
 684879200,
 549195100,
 700158700,
 455700900,
 475587500,
 579393800,
 438786800,
 534942700,
 612760300,
 650625400,
 816746600,
 933754000,
 716122000,
 1473187600,
 612444300,
 490158900,
 614535100,
 480897500,
 738748400,
 728251800,
 581902100,
 651296600,
 746175800,
 630574400,
 667523100,
 611130800,
 599558200,
 681266500,
 541762300]

In [461]:
exdt

    expiration_date
0        2013-01-18
1        2013-02-15
2        2013-03-15
3        2013-04-19
4        2013-05-17
..              ...
120      2023-04-21
121      2023-05-19
122      2023-06-16
123      2023-07-21
124      2023-08-18

[125 rows x 1 columns]

In [462]:
def add_volume_sum_column(df, volume_sums):
    df['volume_sum'] = volume_sums
    return df

In [463]:
amazon_stock_sum = add_volume_sum_column(exdt, amazon_stock_vol_sum)
microsoft_stock_sum = add_volume_sum_column(exdt, microsoft_stock_vol_sum) #THERE IS AN EXTRA RANGE, WHERE? NO CLUE, got the CLUE THERE IS A REPEATED DATE! 
meta_stock_sum = add_volume_sum_column(exdt, meta_stock_vol_sum)
apple_stock_sum = add_volume_sum_column(exdt, apple_stock_vol_sum)
google_stock_sum = add_volume_sum_column(exdt, google_stock_vol_sum)

In [464]:
amazon_stock_sum

    expiration_date  volume_sum
0        2013-01-18  1370963519
1        2013-02-15  2058450767
2        2013-03-15  1956136699
3        2013-04-19  2250981726
4        2013-05-17  1928521581
..              ...         ...
120      2023-04-21   608689900
121      2023-05-19   597085000
122      2023-06-16   540979300
123      2023-07-21   574312600
124      2023-08-18   466215300

[125 rows x 2 columns]

MIN-MAX

In [465]:
def calculate_max_per_period(df, index_ranges):
    max_per_period = [df.loc[start:end, "High"].max() for start, end in index_ranges]
    max_per_period = max_per_period[:-1]
    return max_per_period

In [466]:
amazon_max = calculate_max_per_period(amazon_stock_vol , amazon_stock_idx_range)
microsoft_max= calculate_max_per_period(microsoft_stock_vol , microsoft_stock_idx_range)
meta_max = calculate_max_per_period(meta_stock_vol , meta_stock_idx_range)
apple_max = calculate_max_per_period(apple_stock_vol , apple_stock_idx_range)
google_max = calculate_max_per_period(google_stock_vol , google_stock_idx_range)

In [467]:
len(meta_max)

125

In [468]:
def calculate_min_per_period(df, index_ranges):
    min_per_period = [df.loc[start:end, "Low"].min() for start, end in index_ranges]
    min_per_period = min_per_period[:-1]
    return min_per_period

In [469]:
amazon_min = calculate_min_per_period(amazon_stock_vol , amazon_stock_idx_range)
microsoft_min= calculate_min_per_period(microsoft_stock_vol , microsoft_stock_idx_range)
meta_min = calculate_min_per_period(meta_stock_vol , meta_stock_idx_range)
apple_min = calculate_min_per_period(apple_stock_vol , apple_stock_idx_range)
google_min = calculate_min_per_period(google_stock_vol , google_stock_idx_range)

LET'S PUT ALL TOGETHER

In [470]:
#unified_open_closing get the company_id desired, put it in order, concat:  _stock_sum + create columns max and min

In [471]:
#AMAZN

amazon = unified_open_closing[unified_open_closing["company_id"] == "AMZN"]

In [472]:
amazon = amazon.merge(amazon_stock_sum, on='expiration_date')

In [473]:
amazon

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum
0,2013-01-18,AMZN,13.541500,NaN,NaN,1370963519
1,2013-02-15,AMZN,13.381500,13.541500,-1.181553,2058450767
2,2013-03-15,AMZN,13.249000,13.381500,-0.990173,1956136699
3,2013-04-19,AMZN,12.908000,13.249000,-2.573779,2250981726
4,2013-05-17,AMZN,13.291500,12.908000,2.971026,1928521581
...,...,...,...,...,...,...
120,2023-04-21,AMZN,106.099998,99.790001,6.323276,608689900
121,2023-05-19,AMZN,118.160004,106.099998,11.366641,597085000
122,2023-06-16,AMZN,127.709999,118.160004,8.082257,540979300
123,2023-07-21,AMZN,131.339996,127.709999,2.842375,574312600
124,2023-08-18,AMZN,131.619995,131.339996,0.213186,466215300

In [474]:
amazon["max_period"] = amazon_max
amazon["min_period"] = amazon_min

In [475]:
amazon

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period
0,2013-01-18,AMZN,13.541500,NaN,NaN,1370963519,13.725000,12.663000
1,2013-02-15,AMZN,13.381500,13.541500,-1.181553,2058450767,14.236000,12.755500
2,2013-03-15,AMZN,13.249000,13.381500,-0.990173,1956136699,13.870000,12.786500
3,2013-04-19,AMZN,12.908000,13.249000,-2.573779,2250981726,13.756000,12.603500
4,2013-05-17,AMZN,13.291500,12.908000,2.971026,1928521581,13.790000,12.287500
...,...,...,...,...,...,...,...,...
120,2023-04-21,AMZN,106.099998,99.790001,6.323276,608689900,109.230003,95.699997
121,2023-05-19,AMZN,118.160004,106.099998,11.366641,597085000,118.599998,101.150002
122,2023-06-16,AMZN,127.709999,118.160004,8.082257,540979300,128.410004,113.779999
123,2023-07-21,AMZN,131.339996,127.709999,2.842375,574312600,136.649994,123.849998
124,2023-08-18,AMZN,131.619995,131.339996,0.213186,466215300,143.630005,126.110001

In [476]:
#MSFT
microsoft = unified_open_closing[unified_open_closing["company_id"] == "MSFT"]
microsoft = microsoft.merge(microsoft_stock_sum, on='expiration_date')
microsoft["max_period"] = microsoft_max
microsoft["min_period"] = microsoft_min

In [477]:
microsoft

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period
0,2013-01-18,MSFT,27.100000,NaN,NaN,1370963519,27.730000,26.280001
1,2013-02-15,MSFT,28.040001,27.100000,3.468638,2058450767,28.230000,27.000000
2,2013-03-15,MSFT,28.030001,28.040001,-0.035663,1956136699,28.540001,27.230000
3,2013-04-19,MSFT,29.620001,28.030001,5.672494,2250981726,31.180000,27.809999
4,2013-05-17,MSFT,34.130001,29.620001,15.226198,1928521581,35.099998,30.270000
...,...,...,...,...,...,...,...,...
120,2023-04-21,MSFT,285.010010,278.260010,2.425789,608689900,292.079987,269.519989
121,2023-05-19,MSFT,316.739990,285.010010,11.132935,597085000,322.589996,275.369995
122,2023-06-16,MSFT,351.320007,316.739990,10.917477,540979300,351.470001,312.609985
123,2023-07-21,MSFT,349.149994,351.320007,-0.617674,574312600,366.779999,327.000000
124,2023-08-18,MSFT,314.489990,349.149994,-9.926967,466215300,351.890015,311.549988

In [478]:
#META
meta = unified_open_closing[unified_open_closing["company_id"] == "META"]
meta = meta.merge(meta_stock_sum, on='expiration_date')
meta["max_period"] = meta_max
meta["min_period"] = meta_min
meta

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period
0,2013-01-18,META,30.309999,NaN,NaN,1370963519,32.209999,27.420000
1,2013-02-15,META,28.520000,30.309999,-5.905639,2058450767,32.509998,27.100000
2,2013-03-15,META,27.030001,28.520000,-5.224400,1956136699,29.080000,25.780001
3,2013-04-19,META,25.620001,27.030001,-5.216426,2250981726,28.100000,24.719999
4,2013-05-17,META,26.400000,25.620001,3.044492,1928521581,29.070000,25.690001
...,...,...,...,...,...,...,...,...
120,2023-04-21,META,210.210007,200.559998,4.811532,608689900,222.110001,193.639999
121,2023-05-19,META,247.470001,210.210007,17.725129,597085000,253.570007,207.130005
122,2023-06-16,META,284.750000,247.470001,15.064452,540979300,287.850006,244.949997
123,2023-07-21,META,304.570007,284.750000,6.960494,574312600,318.679993,276.220001
124,2023-08-18,META,279.029999,304.570007,-8.385595,466215300,326.200012,274.380005

In [479]:
#AAPL
apple = unified_open_closing[unified_open_closing["company_id"] == "AAPL"]
apple = apple.merge(apple_stock_sum, on='expiration_date')
apple["max_period"] = apple_max
apple["min_period"] = apple_min
apple

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period
0,2013-01-18,AAPL,17.804285,NaN,NaN,1370963519,19.821428,17.263571
1,2013-02-15,AAPL,16.744642,17.804285,-5.951618,2058450767,18.392500,15.535714
2,2013-03-15,AAPL,15.640357,16.744642,-6.594856,1956136699,16.526072,14.964286
3,2013-04-19,AAPL,13.856071,15.640357,-11.408218,2250981726,16.783930,13.753571
4,2013-05-17,AAPL,15.680357,13.856071,13.165969,1928521581,16.633928,13.973929
...,...,...,...,...,...,...,...,...
120,2023-04-21,AAPL,165.050003,156.080002,5.747053,608689900,168.160004,154.149994
121,2023-05-19,AAPL,176.389999,165.050003,6.870643,597085000,176.389999,162.800003
122,2023-06-16,AAPL,186.729996,176.389999,5.862009,540979300,186.990005,170.520004
123,2023-07-21,AAPL,194.100006,186.729996,3.946881,574312600,198.229996,182.589996
124,2023-08-18,AAPL,172.300003,194.100006,-11.231325,466215300,197.199997,171.960007

In [480]:
#GOOG
google = unified_open_closing[unified_open_closing["company_id"] == "GOOG"]
google = google.merge(google_stock_sum, on='expiration_date')
google["max_period"] = google_max
google["min_period"] = google_min
google

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period
0,2013-01-18,GOOG,17.692682,NaN,NaN,1370963519,18.555450,17.323069
1,2013-02-15,GOOG,19.611490,17.692682,10.845207,2058450767,20.099663,17.323069
2,2013-03-15,GOOG,20.386087,19.611490,3.949710,1956136699,21.021208,19.536772
3,2013-04-19,GOOG,19.157194,20.386087,-6.028097,2250981726,20.404768,18.960432
4,2013-05-17,GOOG,22.665545,19.157194,18.313491,1928521581,22.929056,19.302649
...,...,...,...,...,...,...,...,...
120,2023-04-21,GOOG,106.089996,100.839996,5.206268,608689900,109.629997,100.279999
121,2023-05-19,GOOG,124.199997,106.089996,17.070414,597085000,127.050003,103.269997
122,2023-06-16,GOOG,126.699997,124.199997,2.012882,540979300,129.550003,120.750000
123,2023-07-21,GOOG,120.870003,126.699997,-4.601416,574312600,127.279999,115.830002
124,2023-08-18,GOOG,129.059998,120.870003,6.775871,466215300,134.070007,121.379997

In [481]:
#CONCAT, MAX-MIN % AND BRING TESLA INFO TOO

In [485]:
most = pd.concat([amazon, microsoft, apple, meta, google], axis=0)

In [486]:
most

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period
0,2013-01-18,AMZN,13.541500,NaN,NaN,1370963519,13.725000,12.663000
1,2013-02-15,AMZN,13.381500,13.541500,-1.181553,2058450767,14.236000,12.755500
2,2013-03-15,AMZN,13.249000,13.381500,-0.990173,1956136699,13.870000,12.786500
3,2013-04-19,AMZN,12.908000,13.249000,-2.573779,2250981726,13.756000,12.603500
4,2013-05-17,AMZN,13.291500,12.908000,2.971026,1928521581,13.790000,12.287500
...,...,...,...,...,...,...,...,...
120,2023-04-21,GOOG,106.089996,100.839996,5.206268,608689900,109.629997,100.279999
121,2023-05-19,GOOG,124.199997,106.089996,17.070414,597085000,127.050003,103.269997
122,2023-06-16,GOOG,126.699997,124.199997,2.012882,540979300,129.550003,120.750000
123,2023-07-21,GOOG,120.870003,126.699997,-4.601416,574312600,127.279999,115.830002
124,2023-08-18,GOOG,129.059998,120.870003,6.775871,466215300,134.070007,121.379997

In [491]:
most['max-min%'] = (most['max_period'] - most['min_period'])/(most['min_period'])*100
most

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period,max-min%
0,2013-01-18,AMZN,13.541500,NaN,NaN,1370963519,13.725000,12.663000,8.386638
1,2013-02-15,AMZN,13.381500,13.541500,-1.181553,2058450767,14.236000,12.755500,11.606758
2,2013-03-15,AMZN,13.249000,13.381500,-0.990173,1956136699,13.870000,12.786500,8.473781
3,2013-04-19,AMZN,12.908000,13.249000,-2.573779,2250981726,13.756000,12.603500,9.144285
4,2013-05-17,AMZN,13.291500,12.908000,2.971026,1928521581,13.790000,12.287500,12.227874
...,...,...,...,...,...,...,...,...,...
120,2023-04-21,GOOG,106.089996,100.839996,5.206268,608689900,109.629997,100.279999,9.323891
121,2023-05-19,GOOG,124.199997,106.089996,17.070414,597085000,127.050003,103.269997,23.027023
122,2023-06-16,GOOG,126.699997,124.199997,2.012882,540979300,129.550003,120.750000,7.287787
123,2023-07-21,GOOG,120.870003,126.699997,-4.601416,574312600,127.279999,115.830002,9.885174
124,2023-08-18,GOOG,129.059998,120.870003,6.775871,466215300,134.070007,121.379997,10.454779

TESLA

In [487]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/musk_twt_tesla_stock'
engine = create_engine(connection_string)
query = '''SELECT * FROM filtered_stock_tesla;'''

tesla = pd.read_sql_query(query, engine)

In [492]:
tesla

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period,max-min%
0,2013-01-18,TSLA,2.316000,2.333333,-0.742843,275400000,2.370000,2.140667,10.713156
1,2013-02-15,TSLA,2.566667,2.316000,10.823273,479959500,2.666667,2.284000,16.754247
2,2013-03-15,TSLA,2.442667,2.566667,-4.831168,688348500,2.643333,2.253333,17.307695
3,2013-04-19,TSLA,3.164000,2.442667,29.530550,1075051500,3.346667,2.328000,43.757174
4,2013-05-17,TSLA,6.166667,3.164000,94.900980,3529420500,6.474667,3.183333,103.392702
...,...,...,...,...,...,...,...,...,...
120,2023-04-21,TSLA,164.800003,184.520004,-10.687189,3297880900,207.789993,158.610001,31.006867
121,2023-05-19,TSLA,177.169998,164.800003,7.506065,2513876000,189.320007,152.369995,24.250189
122,2023-06-16,TSLA,258.920013,177.169998,46.142132,3101961400,274.750000,178.220001,54.163393
123,2023-07-21,TSLA,268.000000,258.920013,3.506870,3352898900,299.290009,240.699997,24.341509
124,2023-08-18,TSLA,214.119995,268.000000,-20.104479,2235791900,272.899994,212.360001,28.508190

In [493]:
stock_info_all_2013_2023 = pd.concat([most,tesla], axis=0)

In [494]:
stock_info_all_2013_2023

,expiration_date,company_id,Closing price,Opening price,price_change%,volume_sum,max_period,min_period,max-min%
0,2013-01-18,AMZN,13.541500,NaN,NaN,1370963519,13.725000,12.663000,8.386638
1,2013-02-15,AMZN,13.381500,13.541500,-1.181553,2058450767,14.236000,12.755500,11.606758
2,2013-03-15,AMZN,13.249000,13.381500,-0.990173,1956136699,13.870000,12.786500,8.473781
3,2013-04-19,AMZN,12.908000,13.249000,-2.573779,2250981726,13.756000,12.603500,9.144285
4,2013-05-17,AMZN,13.291500,12.908000,2.971026,1928521581,13.790000,12.287500,12.227874
...,...,...,...,...,...,...,...,...,...
120,2023-04-21,TSLA,164.800003,184.520004,-10.687189,3297880900,207.789993,158.610001,31.006867
121,2023-05-19,TSLA,177.169998,164.800003,7.506065,2513876000,189.320007,152.369995,24.250189
122,2023-06-16,TSLA,258.920013,177.169998,46.142132,3101961400,274.750000,178.220001,54.163393
123,2023-07-21,TSLA,268.000000,258.920013,3.506870,3352898900,299.290009,240.699997,24.341509
124,2023-08-18,TSLA,214.119995,268.000000,-20.104479,2235791900,272.899994,212.360001,28.508190

SENDING INFO TO SQL

In [495]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/twitter_stock_all'
engine = create_engine(connection_string)

#stock_info_all_2013_2023.to_sql('stock_info_all_2013_2023', engine, if_exists='append', index=False)

750